In [8]:
import pandas as pd
import random
from deflator import deflate

Building an synthetic dataset. 

Important to notice that in yearly values the date column **must** be `int` type:

In [20]:
# building yearly synthetic dataset
yearly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2000", end="2018", freq="Y")
        .strftime("%Y")
        .astype("int"),  # selecting only the year and turning it into INT
        "value": [random.random()*100 for i in range(len(pd.date_range(start="2000", end="2018", freq="Y")))],
    }
)
yearly_df.head()

   date      value
0  2000  54.630785
1  2001  27.643187
2  2002  80.559163
3  2003  93.271535
4  2004  13.131182

In [29]:
# using the function with a yearly value deflating to  IPCA's 2005 values:

deflate(
    data_frame=yearly_df, 
    value_column="value", 
    date_column="date", 
    deflate_year=2005
).head(10)

   date      value  deflated_value
0  2000  54.630785       52.021437
1  2001  27.643187       20.495167
2  2002  80.559163       36.576964
3  2003  93.271535       57.055232
4  2004  13.131182        9.830425
5  2005  53.132909       53.132909
6  2006  48.867575       88.498262
7  2007  65.511789       83.611479
8  2008  93.064673       89.698586
9  2009  15.342485       20.244425

When using monthly values, the date column **must** have the **"YYYY-MM"** format as `object`:

In [27]:
# monthly synthetic dataset:

monthly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2001", end="2006", freq="M").strftime("%Y-%m"),
        "value": [
            random.random()*100
            for i in range(len(pd.date_range(start="2001", end="2006", freq="M")))
        ],
    }
)
monthly_df.head()

      date      value
0  2001-01  23.493747
1  2001-02  83.646402
2  2001-03  11.065335
3  2001-04  60.595261
4  2001-05  55.716147

In [28]:
#deflating the series to IPCA's 2005-01 values:
deflate(
    data_frame=monthly_df,
    value_column="value",
    date_column="date",
    deflate_year=2001,
    deflate_month=4,
).head(10)

      date      value  deflated_value
0  2001-01  23.493747       18.645831
1  2001-02  83.646402       83.646402
2  2001-03  11.065335       15.368521
3  2001-04  60.595261       60.595261
4  2001-05  55.716147       56.853212
5  2001-06  88.632113      116.621201
6  2001-07  77.648726       41.302514
7  2001-08  13.408387        5.681520
8  2001-09  64.325981       84.639449
9  2001-10  37.612293       50.827423